# Задание №4:
# Создание программы «Книжная коллекция»
from pprint import pprint
# Создаём книжную коллекцию, добавляем данные о книгах: автор, название книги, жанр, год выпуска, количество страниц, издательство.
data_book = {
    "автор": 0,
    "жанр": 1,
    "год выпуска": 2,
    "Количество страниц": 3,
    "Издательство": 4
}
books = {
    "Властелин колец": ["Р. Толкин", "фэнтези", "1954", "569", "Houghton Mifflin"]
    "Тeмные начала": ["Ф. Пулман", "фантастика", "1995", "367", "Houghton Mifflin"]
    "Пение птиц": ["С. Фолкс", "роман", "1993", "825", "Hutchinson"]
    "Винни-Пух": ["А. Милн", "повесть", "1926", "413", "Royal Magazine"]
}
# 
# 
print("==================Добавление==================")
new_book = {
    "Гарри Поттер": ["Дж.Роулинг", "фэнтэзи", 1997, 390, "Bloomsbury"]
    }
