# Задание №1:
# Создание программы, содержащей ФИО и рост список известных баскетболистов

# Создаём список баскетболистов:
players = {
    "Джордан М": "198 см",
    "О'нилл Ш": "216 см",
    "Джеймс Л": "206 см",
    "Брайант К": "198 см",
    "Бёрд Л": "206 см",
    "Уэстбрук Р": "191 см",
}
# Выводим на экран с помощью ф-и pprint:
from pprint import pprint
pprint(players)
#  Выводим на экран рост баскетболиста:
pprint(players["Джордан М"])
# 
print("==================Добавление нового баскетболиста в список==================")
new_player = {"Романов Е": "180 см"}
players.update(new_player)
pprint(players)
# 
# 
print("==================Удаление баскетболиста из списка==================")
del players["Бёрд Л"]
pprint(players)
# 
# 
print("==================Замена данных роста баскетболиста==================")
players["Джордан М"] = "222 см"
pprint(players["Джордан М"])
pprint(players)
# 
# 
print("==================Поиск данных о баскетболисте==================")
new_player = input("Введи ФИО баскетболиста для поиска: ")
search_player = "Дюрарт К"
if search_player in players:
    print("Этот игрок есть в списке:", search_player)
else:
    print("Игрок", search_player, "не обнаружен в списке")



